assignments/A02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-04 Mon 09:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment 02</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="lx" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Assignment 02
<br />
<span class="subtitle">Multiple Signals</span>
</h1>

<div id="outline-container-org75bf33f" class="outline-2">
<h2 id="org75bf33f">Assignment</h2>
<div class="outline-text-2" id="text-org75bf33f">
<p>
Implement these gates, using these signatures:
</p>

<div class="org-src-container">
<pre class="src src-python">Or16(inp_a, inp_b, out)
Not16(inp_a, inp_b, out)
And16(inp_a, inp_b, out)
Or8Way(inp, out)
Mux(select, inp_a, inp_b, out)
Dmux(select, inp, out_a, out_b)
Mux16(select, inp_a, inp_b, out)
Mux4Way16(select, inp_a, inp_b, inp_c, inp_d, out)
Mux8Way16(select, inp_a, inp_b, inp_c, inp_d, inp_e, inp_f, inp_g, inp_h, out)
DMux4Way(select, inp, out_a, out_b, out_c, out_d)
DMux8Way(select, inp, out_a, out_b, out_c, out_d, out_e, out_f, out_g, out_h)
</pre>
</div>

<p>
Each file should include both the gate and a value called <code>tests</code> containing 5 or more test cases.  
</p>

<p>
Ensure your filename matches the the name of the gate. For example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">filename</th>
<th scope="col" class="org-left">name of gate</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Or16.py</td>
<td class="org-left">Or16</td>
</tr>

<tr>
<td class="org-left">DMux8Way.py</td>
<td class="org-left">DMux8Way</td>
</tr>
</tbody>
</table>

<p>
Refer to the 2nd half of <a href="https://docs.wixstatic.com/ugd/44046b_f2c9e41f0b204a34ab78be0ae4953128.pdf">Chapter 1</a>, beginning around page 20, for more detail on Mux, Demux, and multi-bit gates.
</p>
</div>
</div>

<div id="outline-container-orge32e16c" class="outline-2">
<h2 id="orge32e16c">Testing</h2>
<div class="outline-text-2" id="text-orge32e16c">
</div>
<div id="outline-container-orga6c5161" class="outline-3">
<h3 id="orga6c5161">Inside each .py file</h3>
<div class="outline-text-3" id="text-orga6c5161">
<p>
See <a href="./supplemental/A02/Mux.py">Mux.py</a> or <a href="./supplemental/A02/Or8Way.py">Or8Way.py</a> for examples.
</p>

<p>
Each gate will be tested by comparing the <i>actual</i> outputs (from the myHDL block) with the <i>expected</i> outputs (from the test) for the given inputs.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">filename</th>
<th scope="col" class="org-left">gatename</th>
<th scope="col" class="org-left">5 tests</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Or16.py</td>
<td class="org-left">Or16</td>
<td class="org-left"><code>[[0, 0, 0], [1, 0, 1], [2, 3, 3], [65535, 0, 65535], [65535, 1, 65535]]</code></td>
</tr>

<tr>
<td class="org-left">Mux.py</td>
<td class="org-left">Mux</td>
<td class="org-left"><code>[[0, 1, 1, 1], [0, 0, 0, 0], [0, 0, 1, 0], [1, 0, 0, 0], [1, 0, 1, 1]]</code></td>
</tr>

<tr>
<td class="org-left">etc.</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Or16 has 3 parameters (<code>inp_a</code>, <code>inp_b</code>, <code>out</code>) so each of its tests has 3 values.  Also, because Or16 takes 2 16-bit values, its inputs are in <code>range(0, 2**16)</code> (minimum value 0, maximum value 65535).</li>
<li>Mux has 4 parameters, so each of its 5 tests has 4 values.  Since it's a 1-bit Mux, each of the values in its tests are 0 or 1.</li>
</ul>

<p>
Provide a variable called <code>tests</code>, which is a list containing 5 or more test cases.
Each test case is a list, with the same number of parameters as the gate.
</p>

<p>
For example, <a href="https://github.com/ENGR110/ENGR110.github.io/blob/master/assignments/supplemental/A02/Mux.py">Mux.py</a> looks like this:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Mux.py </span>
<span style="color: #859900; font-weight: bold;">from</span> myhdl <span style="color: #859900; font-weight: bold;">import</span> block, always_comb

<span style="color: #b58900;">@block</span>
<span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">Mux</span>(select, inp_a, inp_b, out):

    <span style="color: #b58900;">@always_comb</span>
    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">f</span>():
        out.<span style="color: #657b83; font-weight: bold;">next</span> = inp_b <span style="color: #859900; font-weight: bold;">if</span> select <span style="color: #859900; font-weight: bold;">else</span> inp_a

    <span style="color: #859900; font-weight: bold;">return</span> f

<span style="color: #268bd2;">tests</span> = [
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">sel a  b  out</span>
  [<span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">0</span>],
  [<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">1</span>],
  [<span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">1</span>],
  [<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">1</span>],
  [<span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">0</span>, <span style="color: #6c71c4;">1</span>, <span style="color: #6c71c4;">1</span>],
]
</pre>
</div>

<p>
Another example, <a href="https://github.com/ENGR110/ENGR110.github.io/blob/master/assignments/supplemental/A02/Or8Way.py">Or8Way.py</a> is also provided for reference.
</p>
</div>
</div>

<div id="outline-container-orgfc515a6" class="outline-3">
<h3 id="orgfc515a6">Run the autograder tests locally</h3>
<div class="outline-text-3" id="text-orgfc515a6">
<p>
You can download all the tests from <a href="https://github.com/ENGR110/ENGR110.github.io/tree/master/assignments/supplemental/A02">here</a> in order to test before submitting to the autograder.  Test files have the same name as the gate files, but start with "Test".
</p>

<p>
To run:
</p>

<ol class="org-ol">
<li><code>cd</code> into the directory containing your files and the test scripts</li>
<li>then use <code>python3 TestName.py</code> from the terminal</li>
</ol>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #657b83; font-weight: bold;">cd</span> ~/folder-where-you-saved-your-files-and-the-tests/
python3 TestAnd16.py
python3 TestDMux4Way.py
python3 TestDMux8Way.py
python3 TestDmux.py
python3 TestMux16.py
python3 TestMux4Way16.py
python3 TestMux8Way16.py
python3 TestMux.py
python3 TestNot16.py
python3 TestOr16.py
python3 TestOr8Way.py
</pre>
</div>
</div>
</div>

<div id="outline-container-org95a6652" class="outline-3">
<h3 id="org95a6652">Note</h3>
<div class="outline-text-3" id="text-org95a6652">
<p>
Working implementations for <code>Or8Way.py</code> and <code>Mux.py</code> are already provided, and <code>Test.py</code> is used by all of the <code>TestGate.py</code> files, so don't remove it.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
